package com.bayi.rerobot.util;

/**
 * Created by ZOUBIN on 2015/12/29.
 * 9:57
 * 控制命令
 *
 */
public class Command {

    /***
     * 按下开关
     */
    public static String[] ON_ON = {"01", "06", "00", "01", "00","01"};
    public static String[] ON_OFF = {"01", "06", "00", "01", "00","00"};
    /***
     * 加水
     */
    public static String[] WATER_ON = {"02", "30", "31", "34", "38","30", "30","30", "30", "30", "30", "30", "30", "31", "30", "30", "30", "30", "34", "30", "03"};
    /***
     * 停止加水
     */
    public static String[] WATER_OFF = {"02", "30", "31", "34", "38", "30", "30", "30", "30", "30", "30", "30", "30", "30", "30", "30", "30", "31", "34", "30", "03"};

    /***
     * 雾量大小
     */
    public static String[] WURANK = {"01", "06", "00", "02", "00","01"};
    /***
     * 风数
     */
    public static String[] wind = {"01", "06", "00", "03", "00","01"};

    /***
     * 按下负离子/uv灯
     */
    public static String[] UV = {"01", "06", "00", "03", "00","01"};
    /***
     * 读取环境数据
     */
    public static String[] Data={"01", "03", "00", "01", "00","00"};
    /***
     * 读取水位数据
     */
    public static String[] waterData={"01", "03", "00", "02", "00","00"};


    /***
     * 红灯关
     */
    public static String[] red_off={"01", "06", "00", "05", "00","02"};
    /***
     * 蓝灯关
     */
    public static String[] blue_off={"01", "06", "00", "06", "00","02"};
    /***
     * 绿灯关
     */
    public static String[] green_off={"01", "06", "00", "07", "00","02"};
    /***
     * 红灯开
     */
    public static String[] red_on={"01", "06", "00", "05", "00","01"};
    /***
     * 蓝灯开
     */
    public static String[] blue_on={"01", "06", "00", "06", "00","01"};
    /***
     * 绿灯开
     */
    public static String[] green_on={"01", "06", "00", "07", "00","01"};
    /***
     * 表情 0 0
     */
    public static String[] look1={"02", "06", "00", "01", "00","01"};
    /***
     * 表情  ^ ^
     */
    public static String[] look2={"02", "06", "00", "01", "00","02"};
    /***
     * 表情  - ^
     */
    public static String[] look3={"02", "06", "00", "01", "00","03"};
    /***
     * 表情 x x
     */
    public static String[] look4={"02", "06", "00", "01", "00","04"};

    /***
     *可以加水
     */
    public static String[] CanAddWater={"01", "03", "00", "06", "00","01"};
    /***
     *d400 0
     */
    public static String[] D400_0={"00", "00", "00", "00", "00","06","01","06","01","8f","00","00"};
    /***
     *d400 1
     */
    public static String[] D400_1={"00", "00", "00", "00", "00","06","01","06","01","8f","00","01"};
    /***
     *d400 0
     */
    public static String[] D401_0={"00", "00", "00", "00", "00","06","01","06","01","90","00","00"};
    /***
     *d401 1
     */
    public static String[] D401_1={"00", "00", "00", "00", "00","06","01","06","01","90","00","01"};
    /***
     *d402 0
     */
    public static String[] D402_0={"00", "00", "00", "00", "00","06","01","06","01","91","00","00"};
    /***
     *d402 2
     */
    public static String[] D402_1={"00", "00", "00", "00", "00","06","01","06","01","91","00","01"};
}
